РП/src/AccumulationRegisters/ДвиженияНоменклатураДоходыРасходы/ДвиженияНоменклатураДоходыРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияНоменклатураДоходыРасходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИсточникГФУНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.НачислениеОценочныхОбязательствПоОтпускам</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.РаспределениеПроизводственныхЗатрат</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.РаспределениеРасходовБудущихПериодов</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.ОтчетКомитентуОСписании</types>
      <types>DocumentRef.ПоступлениеУслугПрочихАктивов</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.РасчетСебестоимостиТоваров</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.НачисленияКредитовИДепозитов</types>
      <types>DocumentRef.ПорчаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗапасов</name>
    <type>
      <types>EnumRef.ТипыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДоходовРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаДоходов</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

РП/src/Enums/ТипыИсточниковУточненияСчета/ТипыИсточниковУточненияСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИсточниковУточненияСчета</name>
  <enumValues>
    <name>ГруппаФинансовогоУчетаНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаРасчетов</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаДоходовРасходов</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаДенежныхСредствДебета</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаДенежныхСредствКредита</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаНоменклатурыДебета</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаНоменклатурыКредита</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаРасчетовДебета</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаРасчетовКредита</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаДоходовРасходовДебета</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаДоходовРасходовКредита</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/ИсточникиПодразделенийАналитическихРегистров/ИсточникиПодразделенийАналитическихРегистров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникиПодразделенийАналитическихРегистров</name>
  <enumValues>
    <name>АналитикаУчетаДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>АналитикаУчетаДенежныхСредствОтправителя</name>
  </enumValues>
  <enumValues>
    <name>АналитикаУчетаДенежныхСредствПолучателя</name>
  </enumValues>
  <enumValues>
    <name>АналитикаУчетаДоходовРасходов</name>
  </enumValues>
  <enumValues>
    <name>АналитикаУчетаНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>АналитикаУчетаПрочихАктивовПассивов</name>
  </enumValues>
  <enumValues>
    <name>ДоговорКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ДокументОплаты</name>
  </enumValues>
  <enumValues>
    <name>Заказ</name>
  </enumValues>
  <enumValues>
    <name>ОбъектРасчетовСКонтрагентом</name>
  </enumValues>
  <enumValues>
    <name>ХозяйственнаяОперация</name>
  </enumValues>
  <enumValues>
    <name>ПодразделениеРегистратора</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/ПоказателиАналитическихРегистров/ПоказателиАналитическихРегистров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоказателиАналитическихРегистров</name>
  <enumValues>
    <name>Себестоимость</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьБезНДС</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьРегл</name>
  </enumValues>
  <enumValues>
    <name>Стоимость</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьБезНДС</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьРегл</name>
  </enumValues>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>СуммаБезНДС</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалюте</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалютеВзаиморасчетов</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалютеВзаиморасчетовДебета</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалютеВзаиморасчетовКредита</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалютеДокумента</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалютеПлатежа</name>
  </enumValues>
  <enumValues>
    <name>СуммаДопРасходов</name>
  </enumValues>
  <enumValues>
    <name>СуммаДопРасходовБезНДС</name>
  </enumValues>
  <enumValues>
    <name>СуммаНДС</name>
  </enumValues>
  <enumValues>
    <name>СуммаНДСДопРасходов</name>
  </enumValues>
  <enumValues>
    <name>СуммаОплаты</name>
  </enumValues>
  <enumValues>
    <name>СуммаПостоплаты</name>
  </enumValues>
  <enumValues>
    <name>СуммаПредоплаты</name>
  </enumValues>
  <enumValues>
    <name>СуммаРегл</name>
  </enumValues>
  <enumValues>
    <name>СуммаКВыплатеВРамкахЛимита</name>
  </enumValues>
  <enumValues>
    <name>СуммаКВыплатеСверхЛимита</name>
  </enumValues>
  <enumValues>
    <name>СуммаКВыплате</name>
  </enumValues>
  <enumValues>
    <name>СуммаВКорВалюте</name>
  </enumValues>
  <enumValues>
    <name>СуммаКорректировки</name>
  </enumValues>
</mdclass:Enum>

РП/src/AccumulationRegisters/ДвиженияНоменклатураДоходыРасходы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//++ НЕ УТ
#Область ПрограммныйИнтерфейс
//++ НЕ УТКА

// Определяет источники уточнения счета, доступные в регистре и их свойства.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ИсточникиУточненияСчета()
//
Функция ИсточникиУточненияСчета(СвойстваИсточника) Экспорт
	
	ИсточникиУточненияСчета = Новый Соответствие;
	
	ИсточникиУточненияСчета.Вставить(Перечисления.ТипыИсточниковУточненияСчета.ГруппаФинансовогоУчетаНоменклатуры,
		Новый Структура(СвойстваИсточника, "ГФУНоменклатуры"));
	
	ИсточникиУточненияСчета.Вставить(Перечисления.ТипыИсточниковУточненияСчета.ГруппаФинансовогоУчетаДоходовРасходов,
		Новый Структура(СвойстваИсточника, "ГФУДоходовРасходов"));
	
	Возврат ИсточникиУточненияСчета;
	
КонецФункции

// Определяет источники подразделений регистра и их свойства.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ИсточникиПодразделений()
//
Функция ИсточникиПодразделений() Экспорт

	ИсточникиПодразделений = Новый Соответствие;
	
	ИсточникиПодразделений.Вставить(Перечисления.ИсточникиПодразделенийАналитическихРегистров.ХозяйственнаяОперация, "Подразделение");
	ИсточникиПодразделений.Вставить(Перечисления.ИсточникиПодразделенийАналитическихРегистров.АналитикаУчетаНоменклатуры, "СкладПодразделение");
	ИсточникиПодразделений.Вставить(Перечисления.ИсточникиПодразделенийАналитическихРегистров.АналитикаУчетаДоходовРасходов, "АналитикаДоходовРасходовПодразделение");
	
	Возврат ИсточникиПодразделений;
	
КонецФункции

// Определяет источники заполнения субконто.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ИсточникиСубконто()
//
Функция ИсточникиСубконто() Экспорт

	МассивСубконто = Новый Массив;
	
	МассивСубконто.Добавить("Номенклатура");
	МассивСубконто.Добавить("Характеристика");
	МассивСубконто.Добавить("Склад");
	МассивСубконто.Добавить("ТипЗапасов");
	МассивСубконто.Добавить("ВидЗапасов");
	МассивСубконто.Добавить("Поставщик");
	МассивСубконто.Добавить("ГФУНоменклатуры");
	МассивСубконто.Добавить("ТипНоменклатуры");
	
	МассивСубконто.Добавить("СтатьяДоходовРасходов");
	МассивСубконто.Добавить("АналитикаДоходов");
	МассивСубконто.Добавить("АналитикаРасходов");

	Возврат Новый Структура("СубконтоДт, СубконтоКт", МассивСубконто, МассивСубконто);
	
КонецФункции

// Определяет показатели в валюте регистра.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ПоказателиВВалюте()
//
Функция ПоказателиВВалюте(СвойстваПоказателей) Экспорт

	ПоказателиВВалюте = Новый Соответствие;
	
	// НЕ ТРЕБУЕТСЯ
	
	Возврат ПоказателиВВалюте;

КонецФункции

// Определяет документы отражаемые в международном учете.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ДокументыКОтражениюВМФУ()
//
Функция ДокументыКОтражениюВМеждународномУчете() Экспорт

	ДокументыКОтражению = Новый Массив;
	ДокументыКОтражению.Добавить("ВнутреннееПотреблениеТоваров");
	ДокументыКОтражению.Добавить("ОприходованиеИзлишковТоваров");
	ДокументыКОтражению.Добавить("ОтчетКомиссионераОСписании");
	ДокументыКОтражению.Добавить("ПрочееОприходованиеТоваров");
	ДокументыКОтражению.Добавить("СписаниеНедостачТоваров");
	
	Возврат ДокументыКОтражению;

КонецФункции
//-- НЕ УТКА

// Определяет показатели регистра.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.Показатели()
//
Функция Показатели(Свойства) Экспорт

	Показатели = Новый Соответствие;
	
	СвойстваПоказателей = Свойства.СвойстваПоказателей;
	СвойстваРесурсов = Свойства.СвойстваРесурсов;
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "Стоимость", "ВалютаУпр"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.Сумма, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СтоимостьБезНДС", "ВалютаУпр"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаБезНДС, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаНДС", "ВалютаУпр"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаНДС, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СтоимостьРегл", "ВалютаРегл"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаРегл, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	Возврат Показатели;
	
КонецФункции

#КонецОбласти
//-- НЕ УТ

#Область ОбновлениеИнформационнойБазы

Функция ПолноеИмяРегистра()
	Возврат "РегистрНакопления.ДвиженияНоменклатураДоходыРасходы";
КонецФункции


Процедура КорректироватьДвиженияОтчетаКомиcсионераОСписании_ДанныеДляОбновления(Параметры) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.ДвиженияНоменклатураДоходыРасходы КАК ДанныеРегистра
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) = ТИП(Документ.ОтчетКомиссионераОСписании)
	|	И ДанныеРегистра.Склад = НЕОПРЕДЕЛЕНО
	|
    |";
    
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
    
    ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(
        Параметры, 
        Регистраторы, 
        ПолноеИмяРегистра()
    );
    
КонецПроцедуры    

// Обработчик обновления BAS УТ 3.2.1
// Заполняется поле "Склад" в движениях регистра по документам ОтчетКомиссионераОСписании
Процедура КорректироватьДвиженияОтчетаКомиcсионераОСписании(Параметры) Экспорт
    
    Запрос = Новый Запрос();
    Запрос.Текст = "
	|ВЫБРАТЬ 
	|	ДанныеРегистра.Регистратор КАК Ссылка,
	|	ДанныеРегистра.МоментВремени КАК МоментВремени,
	|	ДанныеРегистра.Период,
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.НомерСтроки,
	|	ДанныеРегистра.Активность,
    |
	|	ДанныеРегистра.ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Подразделение,
	|	ДанныеРегистра.АналитикаУчетаНоменклатуры,
	|	ВЫРАЗИТЬ(ДанныеРегистра.Регистратор КАК Документ.ОтчетКомиссионераОСписании).Партнер КАК Склад,
	|	ДанныеРегистра.ТипЗапасов,
	|	ДанныеРегистра.ВидЗапасов,
	|	ДанныеРегистра.СтатьяДоходовРасходов,
	|	ДанныеРегистра.АналитикаДоходов,
	|	ДанныеРегистра.АналитикаРасходов,
    |	ДанныеРегистра.АналитикаАктивовПассивов,
    |
	|	ДанныеРегистра.Количество,
	|	ДанныеРегистра.Стоимость,
	|	ДанныеРегистра.СтоимостьБезНДС,
	|	ДанныеРегистра.СтоимостьРегл,
    |
	|	ДанныеРегистра.ИсточникГФУНоменклатуры,
	|	ДанныеРегистра.ДокументДвижения
	|ИЗ
	|	РегистрНакопления.ДвиженияНоменклатураДоходыРасходы КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДляОбработкиДвиженияНоменклатураДоходыРасходы КАК РегистраторыДляОбработки
	|		ПО ДанныеРегистра.Регистратор = РегистраторыДляОбработки.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	МоментВремени УБЫВ
    |
	|ИТОГИ ПО
	|	Ссылка
    |";
    
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Результат = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуРегистраторовРегистраДляОбработки(
        Параметры.Очередь,
        "Документ.ОтчетКомиссионераОСписании", // ПолноеИмяДокумента
		ПолноеИмяРегистра(),
		Запрос.МенеджерВременныхТаблиц
    );
	
	Если НЕ Результат.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
    КонецЕсли;
    
	Если НЕ Результат.ЕстьЗаписиВоВременнойТаблице Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
    КонецЕсли;
	
	ВыборкаПоДокументу = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    Пока ВыборкаПоДокументу.Следующий() Цикл
        
		НачатьТранзакцию();
		
		Попытка
            
            Регистратор = ВыборкаПоДокументу.Ссылка;
            
			Блокировка = Новый БлокировкаДанных;
            
			БлокировкаДокумента = Блокировка.Добавить("Документ.ОтчетКомиссионераОСписании");
			БлокировкаДокумента.УстановитьЗначение("Ссылка", Регистратор);
			БлокировкаДокумента.Режим = РежимБлокировкиДанных.Разделяемый;
            
            БлокировкаРегистра = Блокировка.Добавить("РегистрНакопления.ДвиженияНоменклатураДоходыРасходы.НаборЗаписей");
			БлокировкаРегистра.УстановитьЗначение("Регистратор", Регистратор);
			
			Блокировка.Заблокировать();
            
    		Набор = РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.СоздатьНаборЗаписей();
    		Набор.Отбор.Регистратор.Установить(Регистратор);
			Выборка = ВыборкаПоДокументу.Выбрать();
            Пока Выборка.Следующий() Цикл
    			Запись = Набор.Добавить();
    			ЗаполнитьЗначенияСвойств(Запись, Выборка);
            КонецЦикла;    
            
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
            
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru='Не удалось обработать движения документа %Документ% по регистру ""Движения Номенклатура - Доходы/Расходы"". Причина: %Причина%';uk='Не вдалося обробити рухи документа %Документ% по регістру ""Рухи Номенклатура - Доходи/Витрати"". Причина: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", Регистратор);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
                ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
                УровеньЖурналаРегистрации.Предупреждение,
				Регистратор.Метаданные(), 
                Регистратор, 
                ТекстСообщения
            );
            
		КонецПопытки;
        
    КонецЦикла;
    
	ОбработкаЗавершена = НЕ ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(
        Параметры.Очередь, 
        ПолноеИмяРегистра()
    );
    
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
    
КонецПроцедуры



Процедура КорректироватьДвиженияОтчетаПоКомиссииМеждуОрганизациямиОСписании_ДанныеДляОбновления(Параметры) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Строки.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.ДвиженияНоменклатураДоходыРасходы КАК Строки
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Строки.Регистратор) = ТИП(Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании)
	|");
	
	СписокРегистраторов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ДополнительныеПараметрыОтметки = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметрыОтметки.ЭтоДвижения = Истина;
	ДополнительныеПараметрыОтметки.ПолноеИмяРегистра = ПолноеИмяРегистра();
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, СписокРегистраторов, ДополнительныеПараметрыОтметки);
	
КонецПроцедуры

// Обработчик обновления BAS 3.2.3
// Перезаполняет по новым правилам on-line движения под документами
//    - ОтчетПоКомиссииМеждуОрганизациямиОСписании
Процедура КорректироватьДвиженияОтчетаПоКомиссииМеждуОрганизациямиОСписании(Параметры) Экспорт
	
	ИмяРегистра = "ДвиженияНоменклатураДоходыРасходы";
	ПолноеИмяДокумента = "Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании";
	ВыборкаПоРегистраторам = ОбновлениеИнформационнойБазы.ВыбратьРегистраторыРегистраДляОбработки(
								Параметры.Очередь,
								ПолноеИмяДокумента,
								ПолноеИмяРегистра());
	
	Пока ВыборкаПоРегистраторам.Следующий() Цикл
		
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяДокумента);
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяДокумента);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ВыборкаПоРегистраторам.Регистратор);
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра() + ".НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", ВыборкаПоРегистраторам.Регистратор);
			
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаПоРегистраторам.Регистратор);
			НаборЗаписей.Прочитать();
			
			ДопСвойства = Новый Структура;
			ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(ВыборкаПоРегистраторам.Регистратор, ДопСвойства);
			МенеджерДокумента.ИнициализироватьДанныеДокумента(ВыборкаПоРегистраторам.Регистратор, ДопСвойства, ИмяРегистра);
			НовыеДвижения = ДопСвойства.ТаблицыДляДвижений[СтрШаблон("Таблица%1", ИмяРегистра)];
			НовыеДвижения.Колонки.Добавить("РасчетСебестоимости", Новый ОписаниеТипов("Булево"));
			
			Подразделение = НовыеДвижения[0].Подразделение;
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.РасчетСебестоимости Тогда
					НоваяСтрока = НовыеДвижения.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
					НоваяСтрока.Подразделение = Подразделение;
				КонецЕсли;
			КонецЦикла;
			НаборЗаписей.Загрузить(НовыеДвижения);
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			
			ЗафиксироватьТранзакцию();
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru='Не удалось обработать движения документа %Документ% по регистру ""Движения Номенклатура - Доходы\Расходы"". Причина: %Причина%';uk='Не вдалося обробити рухи документа %Документ% регістру ""Рухи Номенклатура - Доходи\Витрати"". Причина: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", ВыборкаПоРегистраторам.Регистратор);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				ВыборкаПоРегистраторам.Регистратор.Метаданные(), ВыборкаПоРегистраторам.Регистратор, ТекстСообщения);
			
			ВызватьИсключение;
			
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра());
	
КонецПроцедуры



#КонецОбласти

#КонецЕсли
